name: "resnet34"
platform: "pytorch_libtorch"
max_batch_size : 6
input [
  {
    name: "input_image_resnet34"
    data_type: TYPE_FP32
    dims: [ 3, 768, 768 ]
  }
]
output [
  {
    name: "CLASSIFICATION_OUTPUT"
    data_type: TYPE_FP32
    dims: [ -1 ]

  }
]

instance_group [
  {
    count: 2
    kind: KIND_GPU
  }
] 


dynamic_batching {}
